Revit 2027 API
ExternalServices.BuiltInExternalServices.GeolocationServices Property
 Autodesk Internal: The unique id for working with geolocation services
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId GeolocationServices { get; }
Public Shared ReadOnly Property GeolocationServices As ExternalServiceId
	Get
public:
static property ExternalServiceId^ GeolocationServices {
	ExternalServiceId^ get ();
}
static member GeolocationServices : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace